#+TITLE:	Date Dimension
#+SUBTITLE:	Log
#+OPTIONS:	toc:nil num:nil
#+STARTUP:	indent show3levels
#+CATEGORY:	Projects
#+TAGS:		log python datawarehouse datedimension

* Sunday, November 17, 2024
** Switched Virtual Environment Manager From PipEnv to PDM
** Comparing Week Numbers in PSQL, Python, and BASH
- Week numbers appear to be correct, but Week IDs are still incorrect (on Sundays and Mondays)

* Saturday, December 10, 2022
:LOGBOOK:
CLOCK: [2022-12-10 Sat 11:15]--[2022-12-10 Sat 12:30] =>  1:15
:END:
** Installed SQLAcodegen
- It doesn't work in Python-3.11 or when installed with ~pipx~, so I installed it system-wide under Python-3.10, and it works
- Copied the model it generated to ~models.py~
** Used Alembic to Generate the ~dim_date~ table in ~demodb~
- This was a test, since ~dim_date~ already exists in ~developmentdb~
- Ran ~dim_date.sql~ to populate the table

* Saturday, November 26, 2022
:LOGBOOK:
CLOCK: [2022-11-26 Sat 16:15]--[2022-11-26 Sat 17:15] =>  1:00
CLOCK: [2022-11-26 Sat 10:15]--[2022-11-26 Sat 12:45] =>  2:30
:END:
- I was ready to re-do the entire date dimension logic in Python, but I may just update the week-related columns with Python
- After tweaking the ~dim_date.sql~ script, it appears that I did get the week stuff correct--it appears that there is nothing that needs to be done, here




